{"id":1474,"date":"2022-11-23T13:15:11","date_gmt":"2022-11-23T13:15:11","guid":{"rendered":"https:\/\/pythononlinecompiler.com\/?page_id=1474"},"modified":"2022-12-26T15:44:58","modified_gmt":"2022-12-26T15:44:58","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/pythononlinecompiler.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<h1 style=\"text-align: center;\">Privacy Policy Python Online Compiler<\/h1>\n<p data-private=\"redact\" data-wt-guid=\"49f78901-cf38-426a-ab65-2508e97592ab\" data-pm-slice=\"1 1 []\">Our <strong>Privacy Policy<\/strong> describes how we collect and record information and how it is used.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"48486034-f48a-4ec9-a3f8-aa298bca2d79\">Please feel free to <a href=\"https:\/\/pythononlinecompiler.com\/contact-us\/\">contact us<\/a> if you have any additional questions or need more information about our Privacy Policy.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"d340c5d5-e3ef-48be-9c8e-80f3ec340869\">This Privacy Policy only applies to our online activities and is valid for visitors to our <strong>website\/mobile<\/strong> app regarding the information they share and\/or collect.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"d340c5d5-e3ef-48be-9c8e-80f3ec340869\">All information collected offline or through channels other than this <strong>website\/app<\/strong> is not subject to this policy.<\/p>\n<h2>Acceptance:<\/h2>\n<p>The terms of our Privacy Policy apply to our <strong>website\/mobile app<\/strong> and are agreed upon by you by using it.<\/p>\n<p>&nbsp;<\/p>\n<h2>Web beacons and cookies:<\/h2>\n<p>Our website\/app uses &#8216;cookies&#8217;, just like most websites\/apps. This type of cookie stores information about visitors, such as their preferences and the pages of the website or mobile app they visited.<\/p>\n<p>Users&#8217; browser types or other information are used to customize the web page content to optimize their experience.<\/p>\n<p>&nbsp;<\/p>\n<h2>Data we collect:<\/h2>\n<p>At the time we ask for your personal information, we will make clear to you what information we are asking for and why we are asking for it.<\/p>\n<p>We may receive additional information about you if you contact us directly, including your name, email address, phone number, messages and attachments you send us, and any other information you provide.<\/p>\n<p>We may ask you for contact information when you register for an Account, including your name, company name, address, email address, and telephone number.<\/p>\n<p>&nbsp;<\/p>\n<h2>What we do with your information:<\/h2>\n<p>Our use of information includes:<\/p>\n<ol>\n<li>We operate, maintain, and provide our mobile app and website<\/li>\n<li>Our website and mobile app need to be improved, personalized, and expanded<\/li>\n<li>Our website\/mobile app is used by millions of people around the world<\/li>\n<li>Create new products, services, features, and functionality<\/li>\n<li>Directly or indirectly, communicate with you regarding customer service, updates and other information about our website\/app, and marketing and promotion.<\/li>\n<li>We&#8217;ll email you<\/li>\n<li>Fraud prevention and detection<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>The log files:<\/h2>\n<p>Log files are used according to a standard procedure. Visits to websites and mobile apps are logged in these files. This is something all hosting companies do as part of their analytics.<\/p>\n<p>Log files collect information about IP addresses, browser types, Internet Service Providers (ISPs), date and time stamps, referring\/exit pages, and potentially click counts. No personally identifiable information is linked to these.<\/p>\n<p>Data collected from the website is used to analyze trends, administer the site, track users&#8217; movements, and gather demographic information.<\/p>\n<p>&nbsp;<\/p>\n<h2>Privacy Policies of Advertising Partners:<\/h2>\n<p>We use third-party ad servers and ad networks that use technologies such as cookies, JavaScript, and Web Beacons in their advertisements and links on our website that are sent directly to users&#8217; browsers.<\/p>\n<p>When this happens, they automatically receive your IP address. You will see these technologies on websites\/mobile apps when you visit them for the purpose of measuring the effectiveness of their advertising campaigns.<\/p>\n<p>Please note that our website does not have access to or control over third-party cookies.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"c17c7ab7-2079-469f-ba33-b933c8cac858\" data-pm-slice=\"1 1 []\"><mark class=\"wordtune-highlight bg-info-lightest pt-[2px] pb-[3px]\">If y<\/mark>ou would like more detailed information about these third-party ad servers, please refer to their respective Privacy Policies. The notice may include information about their practices and instructions on how to opt-out.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"4aefed82-2b6f-49bc-9a0e-d5a4774edc11\">Cookies can be disabled through your browser&#8217;s settings. Websites\/mobile apps that are specifically designed to manage cookies can be found <span class=\"issue-underline underline text-gray-darkest font-body decoration-2 underline-offset-4 transition decoration-error-main hover:bg-error-lightest\" data-issueid=\"8576bb8d-0010-4faa-9733-45b12e6018c3\" data-testid=\"issue-underline:on\">at<\/span> the respective websites\/apps for those browsers.<\/p>\n<p data-private=\"redact\" data-wt-guid=\"4aefed82-2b6f-49bc-9a0e-d5a4774edc11\">\n<h2>CCPA Privacy Rights:<\/h2>\n<p>A California consumer&#8217;s CCPA rights include:<\/p>\n<p>Businesses that collect personal data about consumers is required to disclose the specific categories and pieces of information they have collected.<\/p>\n<p>Any personal data that a business has collected about the consumer can be requested to be deleted.<\/p>\n<p>Ensure that a business that sells personal information about consumers does not sell that information to third parties.<\/p>\n<p>Requests will be handled within one month of submission. We would be glad to assist you if you wish to exercise any of these rights.<\/p>\n<p>&nbsp;<\/p>\n<h2>Rights under GDPR<\/h2>\n<p>All of your data protection rights should be fully understood by you. The following rights are available to every user:<\/p>\n<p>Your right of access enables you to obtain copies of your personal data. A small fee may be charged for this service.<\/p>\n<p>Rectification rights &#8211; If you believe the information we have about you is inaccurate, you can ask us to correct it. In addition, you may ask us to complete any incomplete information you believe we have.<\/p>\n<p>Under certain circumstances, you have the right to request that your personal data be erased.<\/p>\n<p>In certain circumstances, you have the right to request a restriction on how we process your personal data.<\/p>\n<p>Under certain conditions, you can object to our processing of your personal data.<\/p>\n<p>Under certain conditions, you have the right to request that we transfer the information we have collected to another organization.<\/p>\n<p>The response time for a request is one month. You may exercise any of these rights by contacting us.<\/p>\n<p>&nbsp;<\/p>\n<h2>Children&#8217;s Information<\/h2>\n<p>We also prioritize protecting children while they use the internet. Online activity should be observed, monitored, and guided by parents and guardians.<\/p>\n<p>Children under the age of 13 are not knowingly collected by our online compiler. Please contact us immediately if you believe your child provided this kind of information on our website\/mobile app, and we will do our best to promptly remove such information.<\/p>\n<p>&nbsp;<\/p>\n<h2>Privacy Policy Changes<\/h2>\n<p>It is possible that we will update our Privacy Policy in the future.<\/p>\n<p>This page may change periodically, so you should check it periodically. In the event that there are any changes, we will post the new Privacy Policy on this page.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"Privacy Policy Python Online Compiler Our Privacy Policy describes how we collect and record information and how it is used. Please feel free \n<a class=\"moretag\" href=\"https:\/\/pythononlinecompiler.com\/privacy-policy\/\"> [...]<\/a>","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/pages\/1474"}],"collection":[{"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/comments?post=1474"}],"version-history":[{"count":0,"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/pages\/1474\/revisions"}],"wp:attachment":[{"href":"https:\/\/pythononlinecompiler.com\/wp-json\/wp\/v2\/media?parent=1474"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}